function solve(string) {
    let pattern = /\+359 2 \d{3} \d{4}|\+359-2-\d{3}-\d{4}\b/g;

    let result = pattern.exec(string);
    let arrResults = [];
    while (result !== null) {
        arrResults.push(result[0]);

        result = pattern.exec(string);
    }

    console.log(arrResults.join(', '));
}

solve("+359 2 222 2222,359-2-222-2222, +359/2/222/2222, +359-2 222 2222 +359 2-222-2222, +359-2-222-222, +359-2-222-22222 +359-2-222-2222");
/*
странно, но и с това работи, което реално джъджа си подава, дори и ако добавя втори
стринг в масива, не дава грешка, а връща и резултата от него, което може да е 
готино, но може би може и да бъде проблем някога, не знам

solve(["+359 2 222 2222,359-2-222-2222, +359/2/222/2222, +359-2 222 2222 +359 2-222-2222, +359-2-222-222, +359-2-222-22222 +359-2-222-2222",'+359 2 222 2222']);
*/